# Lab-Data-Manipulation (PART-1)

In [3]:
import pandas as pd

# Context 

For this lab you'll use a dataset for UFO observations. The objective is to exercise the manipulation of a dataframe, so we'll use the tools we've learned about `reading`, `renaming`, `selecting specific columns`, `filtering based on conditions` and `merging` dataframes to try to better understand our dataset and store an enriched version of our dataset at the end.

Good Luck.

variable	|class|	description
------------|-----|-------------
date_time	|datetime (mdy h:m)	| Date time sighting occurred
city_area	|character	        | City or area of sighting
state	    |character          |	state/region of sighting
country	    |character          |	Country of sighting
ufo_shape	|character          |	UFO Shape
encounter_length	|double     |	Encounter length in seconds
described_encounter_length	|character |	Encounter length as described (eg 1 hour, etc)
description	|character          |	Description of encounter
date_documented	|character      |	Date documented
latitude	|double             |	Latitude
longitude	|double             |	Longitude

## Read the dataset and store it in a dataframe called `ufo`

Pay attention at the file separator.

In [4]:
ufo = pd.read_csv('./data/ufo.csv', sep=';')
ufo.head()

,Unnamed: 0,date,year,month,day,date_time,city_area,state,country,ufo_shape,encounter_length,described_encounter_length,description,date_documented,latitude,longitude
0,0,1949-10-10,1949,10,10,10/10/1949 20:30,san marcos,tx,us,cylinder,2700.0,45 minutes,This event took place in early fall around 194...,4/27/2004,29.883056,-97.941111
1,1,1949-10-10,1949,10,10,10/10/1949 21:00,lackland afb,tx,NaN,light,7200.0,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,12/16/2005,29.384210,-98.581082
2,2,1955-10-10,1955,10,10,10/10/1955 17:00,chester (uk/england),NaN,gb,circle,20.0,20 seconds,Green/Orange circular disc over Chester&#44 En...,1/21/2008,53.200000,-2.916667
3,3,1956-10-10,1956,10,10,10/10/1956 21:00,edna,tx,us,circle,20.0,1/2 hour,My older brother and twin sister were leaving ...,1/17/2004,28.978333,-96.645833
4,4,1960-10-10,1960,10,10,10/10/1960 20:00,kaneohe,hi,us,light,900.0,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,1/22/2004,21.418056,-157.803611

## Check the first 6 columns of the dataframe

In [5]:
ufo.columns[0:6]

Index(['Unnamed: 0', 'date', 'year', 'month', 'day', 'date_time'], dtype='object')

## Check the shape of your dataframe to see how many rows and columns it has

In [6]:
ufo.shape

(80332, 16)

## Bring the date information to the beginning of the dataframe

If you check the dataframe columns, there are some information of the date at the end of the dataframe. For this task, you should reorder the columns in a way that the first few columns all show the date information. 

*Hint: Use the ufo.columns to see all the column names you have.

In [7]:
ufo.columns

Index(['Unnamed: 0', 'date', 'year', 'month', 'day', 'date_time', 'city_area',
       'state', 'country', 'ufo_shape', 'encounter_length',
       'described_encounter_length', 'description', 'date_documented',
       'latitude', 'longitude'],
      dtype='object')

In [8]:
columns_new = ['date_documented', 'date', 'year', 'month', 'day', 'date_time', 'city_area',
       'state', 'country', 'ufo_shape', 'encounter_length',
       'described_encounter_length', 'description',
       'latitude', 'longitude']
ufo = ufo[columns_new]

## Just check if you did it the right way. Take a look at the head of the dataframe again and see if the `ufo` dataframe now is reordered.

In [9]:
ufo.head()

,date_documented,date,year,month,day,date_time,city_area,state,country,ufo_shape,encounter_length,described_encounter_length,description,latitude,longitude
0,4/27/2004,1949-10-10,1949,10,10,10/10/1949 20:30,san marcos,tx,us,cylinder,2700.0,45 minutes,This event took place in early fall around 194...,29.883056,-97.941111
1,12/16/2005,1949-10-10,1949,10,10,10/10/1949 21:00,lackland afb,tx,NaN,light,7200.0,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,29.384210,-98.581082
2,1/21/2008,1955-10-10,1955,10,10,10/10/1955 17:00,chester (uk/england),NaN,gb,circle,20.0,20 seconds,Green/Orange circular disc over Chester&#44 En...,53.200000,-2.916667
3,1/17/2004,1956-10-10,1956,10,10,10/10/1956 21:00,edna,tx,us,circle,20.0,1/2 hour,My older brother and twin sister were leaving ...,28.978333,-96.645833
4,1/22/2004,1960-10-10,1960,10,10,10/10/1960 20:00,kaneohe,hi,us,light,900.0,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,21.418056,-157.803611

## Select a piece of your dataframe. Create a new dataframe called `ufo_vars` and select only the following columns of the `ufo` dataframe. 

`year`, `month`, `state`, `country`, `ufo_shape`, `encounter_length`

In [10]:
ufo_vars = ufo[['year', 'month', 'state', 'country', 'ufo_shape', 'encounter_length']]

Perform a *.head()* on your result to check if you did it right.

In [11]:
ufo_vars.head()

   year  month state country ufo_shape  encounter_length
0  1949     10    tx      us  cylinder            2700.0
1  1949     10    tx     NaN     light            7200.0
2  1955     10   NaN      gb    circle              20.0
3  1956     10    tx      us    circle              20.0
4  1960     10    hi      us     light             900.0

## Rename the variable `encounter_length` to `encounter_seconds`. Keep using the `ufo_vars` dataset for the following tasks, unless specifically specified.

Again, check your results to check if you did it right.

In [12]:
ufo_vars.rename(columns={'encounter_length':'ecounter_seconds'})

       year  month state country ufo_shape  ecounter_seconds
0      1949     10    tx      us  cylinder            2700.0
1      1949     10    tx     NaN     light            7200.0
2      1955     10   NaN      gb    circle              20.0
3      1956     10    tx      us    circle              20.0
4      1960     10    hi      us     light             900.0
...     ...    ...   ...     ...       ...               ...
80327  2013      9    tn      us     light             600.0
80328  2013      9    id      us    circle            1200.0
80329  2013      9    ca      us     other            1200.0
80330  2013      9    va      us    circle               5.0
80331  2013      9    ok      us     cigar            1020.0

[80332 rows x 6 columns]

## Let's start filtering some records. Create a new dataframe called `ufo_us` and filter the `ufo_vars` dataframe bringing only the results in which the `country` is `"us"`

### Use a mask to perform this task 

A `mask` is nothing more than a condition. This condition is applied to your whole dataframe (or pandas Series).
So for example, if you had a pandas Series with a variable called `Age`, you could create a mask for all people whose `Age` is less than 18 years old using the syntax:

`df['Age'] <= 18`

This would return a pandas series containing `True` and `False` values. For each index, you'd get a value of `True` or `False`.

You could save this mask in a variable, for example:

`condition = (df['Age'] <= 18)`

And then you could use that variable `condition` to select only the cases of the dataframe in which the index returned `True` using:
df[condition].

In [13]:
condition = (ufo['country'] == 'us')
ufo[condition]

,date_documented,date,year,month,day,date_time,city_area,state,country,ufo_shape,encounter_length,described_encounter_length,description,latitude,longitude
0,4/27/2004,1949-10-10,1949,10,10,10/10/1949 20:30,san marcos,tx,us,cylinder,2700.0,45 minutes,This event took place in early fall around 194...,29.883056,-97.941111
3,1/17/2004,1956-10-10,1956,10,10,10/10/1956 21:00,edna,tx,us,circle,20.0,1/2 hour,My older brother and twin sister were leaving ...,28.978333,-96.645833
4,1/22/2004,1960-10-10,1960,10,10,10/10/1960 20:00,kaneohe,hi,us,light,900.0,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,21.418056,-157.803611
5,4/27/2007,1961-10-10,1961,10,10,10/10/1961 19:00,bristol,tn,us,sphere,300.0,5 minutes,My father is now 89 my brother 52 the girl wit...,36.595000,-82.188889
7,10/2/1999,1965-10-10,1965,10,10,10/10/1965 23:45,norwalk,ct,us,disk,1200.0,20 minutes,A bright orange color changing to reddish colo...,41.117500,-73.408333
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
80327,9/30/2013,2013-09-09,2013,9,9,9/9/2013 21:15,nashville,tn,us,light,600.0,10 minutes,Round from the distance/slowly changing colors...,36.165833,-86.784444
80328,9/30/2013,2013-09-09,2013,9,9,9/9/2013 22:00,boise,id,us,circle,1200.0,20 minutes,Boise&#44 ID&#44 spherical&#44 20 min&#44 10 r...,43.613611,-116.202500
80329,9/30/2013,2013-09-09,2013,9,9,9/9/2013 22:00,napa,ca,us,other,1200.0,hour,Napa UFO&#44,38.297222,-122.284444
80330,9/30/2013,2013-09-09,2013,9,9,9/9/2013 22:20,vienna,va,us,circle,5.0,5 seconds,Saw a five gold lit cicular craft moving fastl...,38.901111,-77.265556
80331,9/30/2013,2013-09-09,2013,9,9,9/9/2013 23:00,edmond,ok,us,cigar,1020.0,17 minutes,2 witnesses 2 miles apart&#44 Red &amp; White...,35.652778,-97.477778

### Use the .query() method to perform the same task

Remember that the .query() method expects a string. That string should contain the variable of your dataframe without quotation marks and the comparison. For example, if you had a variable called `name`, you'd use a syntax like:
 `df.query('name == "Jack"')`
 
to bring all observations whose column `name` is exactly equal to `"Jack"` (note that Jack should be within quotation marks because a name is a string in this example).

In [14]:
ufo.query('country == "us"')

,date_documented,date,year,month,day,date_time,city_area,state,country,ufo_shape,encounter_length,described_encounter_length,description,latitude,longitude
0,4/27/2004,1949-10-10,1949,10,10,10/10/1949 20:30,san marcos,tx,us,cylinder,2700.0,45 minutes,This event took place in early fall around 194...,29.883056,-97.941111
3,1/17/2004,1956-10-10,1956,10,10,10/10/1956 21:00,edna,tx,us,circle,20.0,1/2 hour,My older brother and twin sister were leaving ...,28.978333,-96.645833
4,1/22/2004,1960-10-10,1960,10,10,10/10/1960 20:00,kaneohe,hi,us,light,900.0,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,21.418056,-157.803611
5,4/27/2007,1961-10-10,1961,10,10,10/10/1961 19:00,bristol,tn,us,sphere,300.0,5 minutes,My father is now 89 my brother 52 the girl wit...,36.595000,-82.188889
7,10/2/1999,1965-10-10,1965,10,10,10/10/1965 23:45,norwalk,ct,us,disk,1200.0,20 minutes,A bright orange color changing to reddish colo...,41.117500,-73.408333
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
80327,9/30/2013,2013-09-09,2013,9,9,9/9/2013 21:15,nashville,tn,us,light,600.0,10 minutes,Round from the distance/slowly changing colors...,36.165833,-86.784444
80328,9/30/2013,2013-09-09,2013,9,9,9/9/2013 22:00,boise,id,us,circle,1200.0,20 minutes,Boise&#44 ID&#44 spherical&#44 20 min&#44 10 r...,43.613611,-116.202500
80329,9/30/2013,2013-09-09,2013,9,9,9/9/2013 22:00,napa,ca,us,other,1200.0,hour,Napa UFO&#44,38.297222,-122.284444
80330,9/30/2013,2013-09-09,2013,9,9,9/9/2013 22:20,vienna,va,us,circle,5.0,5 seconds,Saw a five gold lit cicular craft moving fastl...,38.901111,-77.265556
80331,9/30/2013,2013-09-09,2013,9,9,9/9/2013 23:00,edmond,ok,us,cigar,1020.0,17 minutes,2 witnesses 2 miles apart&#44 Red &amp; White...,35.652778,-97.477778

See which one do you prefer the most and keep using it for the exercises that follow

## For the `ufo_us` dataframe, select only the cases in which the year is in the first decade (2001-2010). Put that in a variable called `ufo_us_2000`.

Check your results.

In [15]:
condition1 = (ufo['year'] >= 2001)
condition2 = (ufo['year'] <= 2010)
ufo_us_2000 = ufo[condition1 & condition2]
ufo_us_2000.head()

,date_documented,date,year,month,day,date_time,city_area,state,country,ufo_shape,encounter_length,described_encounter_length,description,latitude,longitude
102,7/1/2002,2001-10-10,2001,10,10,10/10/2001 03:00,rockwell city,ia,us,triangle,240.0,4 min.s,Large&#44silent&#44slow&#44low to the ground d...,42.395278,-94.633611
103,11/20/2001,2001-10-10,2001,10,10,10/10/2001 04:33,sydney (nsw&#44 australia),NaN,au,formation,180.0,3 minutes,formation and impact,-33.861481,151.205475
104,5/12/2011,2001-10-10,2001,10,10,10/10/2001 20:10,vancouver (canada),bc,ca,other,300.0,+5 minutes,I observed an green object significantly above...,49.250000,-123.133333
105,11/20/2001,2001-10-10,2001,10,10,10/10/2001 20:35,hayward,ca,us,circle,120.0,2/min.,FALLING STAR STOPS &#39SHOTS OUT DOZENS OF ...,37.668889,-122.079722
106,11/20/2001,2001-10-10,2001,10,10,10/10/2001 21:15,ottumwa,ia,us,rectangle,300.0,3-5 minutes,We saw a square object at night&#44 which had...,41.004167,-92.373611

## Try to do the same without the intermediate step of creating the `ufo_us` dataframe. That is, try to filter the dataset for the cases in which the country is "us" and the year is (2001-2010)



*Hint:* You have to make sure all of these conditions are applied simultaneously - using the `and` (or `&`) operator. Try to understand when to use the `and` and the `&` operator.

In [16]:
condition3 = (ufo['country'] == 'us')
ufo_us = ufo[condition1 & condition2 & condition3]
ufo_us.head()

,date_documented,date,year,month,day,date_time,city_area,state,country,ufo_shape,encounter_length,described_encounter_length,description,latitude,longitude
102,7/1/2002,2001-10-10,2001,10,10,10/10/2001 03:00,rockwell city,ia,us,triangle,240.0,4 min.s,Large&#44silent&#44slow&#44low to the ground d...,42.395278,-94.633611
105,11/20/2001,2001-10-10,2001,10,10,10/10/2001 20:35,hayward,ca,us,circle,120.0,2/min.,FALLING STAR STOPS &#39SHOTS OUT DOZENS OF ...,37.668889,-122.079722
106,11/20/2001,2001-10-10,2001,10,10,10/10/2001 21:15,ottumwa,ia,us,rectangle,300.0,3-5 minutes,We saw a square object at night&#44 which had...,41.004167,-92.373611
107,11/20/2001,2001-10-10,2001,10,10,10/10/2001 21:30,fresno,ca,us,changing,900.0,15 min. apprx,Objects were sighted driving north on Highway ...,36.747778,-119.771389
108,11/20/2001,2001-10-10,2001,10,10,10/10/2001 22:00,phoenix,az,us,triangle,60.0,less then a minute,Triangle shaped craft spotted flying west to e...,33.448333,-112.073333

## BONUS 1:  Compare the number of triangular UFO occurrances (checking the `ufo_shape` variable) in the US from the year 2001 up to 2010 as compared to the years of 1991 up to 2000.

*Hint: you should expect roughly ~3 times more cases for 2001-2010 than 1991-2000.*

In [17]:
# calculate the dataframe from 2001-2010 here
ufo_us['ufo_shape'].value_counts()['triangle']

3353

In [18]:
# calculate the dataframe from 1991-2000 here
condition1 = (ufo['year'] >= 1991)
condition2 = (ufo['year'] <= 2000)
condition3 = (ufo['country'] == 'us')
ufo_us_1990 = ufo[condition1 & condition2 & condition3]
ufo_us_1990['ufo_shape'].value_counts()['triangle']

1116

How many rows does each dataset have?

## BONUS 1.1: How many values does each category of `ufo_shape` has.

In [106]:
ufo_us_1990['ufo_shape'].value_counts()

light        1660
triangle     1116
fireball      727
other         721
circle        638
disk          605
sphere        528
unknown       510
oval          334
formation     265
cigar         233
changing      191
cylinder      144
chevron       143
rectangle     138
diamond       129
flash         127
egg           110
teardrop       74
cone           35
cross          20
delta           5
round           2
changed         1
pyramid         1
hexagon         1
crescent        1
flare           1
Name: ufo_shape, dtype: int64

In [107]:
ufo_us['ufo_shape'].value_counts()

light        7200
triangle     3353
circle       2786
unknown      2498
other        2333
sphere       1996
fireball     1868
disk         1815
oval         1525
formation     986
changing      921
cigar         845
flash         565
rectangle     541
cylinder      516
diamond       458
chevron       438
teardrop      345
egg           301
cone          131
cross          98
Name: ufo_shape, dtype: int64

# Lab-Data-Manipulation (PART-2)

The second part of this lab consists of grouping and merging results.

# Grouping up the results.

## Let's calculate the average of the encounter for each country.

We should now group the results by the country column to see what is the mean encounter_seconds for each country. Do this using the `groupby` method of your dataframe `ufo_vars`. What is the average of the encounter for the us? And for Canada?

Remember that after grouping by a column, you have to specify a `aggregating function`. If you don't do that, the results of the groupby will only be a `groupby` pandas object. For this case, we want the aggregating function to be the `mean` function and then the results will appear for us.

Also remember that **if you don't** specify the `as_index=False` argument, the variables you use to group are going to become your new indexes.

In [109]:
ufo_vars.groupby(by=['country'], as_index=False).agg('mean')[['country', 'encounter_length']]

  country  encounter_length
0      au       3806.469238
1      ca      28859.437007
2      de      24255.980952
3      gb      66061.321207
4      us       5800.192049

## Perform the same task, but instead of calculating the mean, count how many occurrances for each country.

For this case, the aggregating function should be the `count` function. Try to understand the results for each column.

In [43]:
ufo_vars['country'].value_counts()

us    65114
ca     3000
gb     1905
au      538
de      105
Name: country, dtype: int64

## Perform the same task, but instead of calculating the mean, use the `.describe()` aggregating function to see the effects.

The describe aggregating function will show you several important statistics for the grouped results, such as `mean`, `median`, `standard deviation`, `count`, `max`, `min`, and so on.

*Hint: If it starts to get difficult to see the results, you can tranpose the resulting dataframe by just putting a `.T` at the end.*

In [45]:
ufo_vars.groupby(by=['country'], as_index=False).agg('describe').T

                                   0             1             2  \
year             count  5.380000e+02  3.000000e+03  1.050000e+02
                 mean   2.002693e+03  2.003694e+03  2.001543e+03
                 std    8.501768e+00  9.382976e+00  1.241125e+01
                 min    1.958000e+03  1.936000e+03  1.962000e+03
                 25%    2.001000e+03  2.002000e+03  2.000000e+03
                 50%    2.004000e+03  2.005000e+03  2.006000e+03
                 75%    2.007000e+03  2.010000e+03  2.009000e+03
                 max    2.014000e+03  2.014000e+03  2.014000e+03
month            count  5.380000e+02  3.000000e+03  1.050000e+02
                 mean   6.128253e+00  6.861667e+00  6.247619e+00
                 std    3.418689e+00  2.870414e+00  3.081524e+00
                 min    1.000000e+00  1.000000e+00  1.000000e+00
                 25%    3.000000e+00  5.000000e+00  4.000000e+00
                 50%    6.000000e+00  7.000000e+00  6.000000e+00
                 75%    9.000000e+00  9.000000e+00  8.000000e+00
                 max    1.200000e+01  1.200000e+01  1.200000e+01
encounter_length count  5.380000e+02  3.000000e+03  1.050000e+02
                 mean   3.806469e+03  2.885944e+04  2.425598e+04
                 std    5.434101e+04  1.511732e+06  1.859988e+05
                 min    5.000000e-01  2.000000e-02  2.000000e+00
                 25%    3.000000e+01  2.000000e+01  3.000000e+01
                 50%    1.800000e+02  1.200000e+02  1.800000e+02
                 75%    6.000000e+02  6.000000e+02  6.000000e+02
                 max    1.209600e+06  8.280000e+07  1.814400e+06

                                   3             4
year             count  1.905000e+03  6.511400e+04
                 mean   2.003648e+03  2.004090e+03
                 std    8.406754e+00  1.038569e+01
                 min    1.943000e+03  1.910000e+03
                 25%    2.002000e+03  2.001000e+03
                 50%    2.005000e+03  2.007000e+03
                 75%    2.009000e+03  2.011000e+03
                 max    2.014000e+03  2.014000e+03
month            count  1.905000e+03  6.511400e+04
                 mean   6.562205e+00  6.861597e+00
                 std    3.287748e+00  3.248243e+00
                 min    1.000000e+00  1.000000e+00
                 25%    4.000000e+00  4.000000e+00
                 50%    7.000000e+00  7.000000e+00
                 75%    9.000000e+00  1.000000e+01
                 max    1.200000e+01  1.200000e+01
encounter_length count  1.905000e+03  6.511200e+04
                 mean   6.606132e+04  5.800192e+03
                 std    2.314714e+06  4.045197e+05
                 min    3.000000e-01  1.000000e-02
                 25%    3.000000e+01  3.000000e+01
                 50%    1.800000e+02  1.800000e+02
                 75%    6.000000e+02  6.000000e+02
                 max    9.783600e+07  6.627600e+07

## Now, let's get deeper in the analysis and group the results not only by country. But by `country` and `year`

### Check the values of the mean and count for the `encounter_seconds` variable for each year. Can you see some discrepancy?

*Hint*: If you want, you can use the `ufo_us` dataset just to see the results for the united states. You could also (in a hacky way) perform the filter right before the groupby operation if you wanted.

In [83]:
ufo_us[['year','country','encounter_length']].groupby(['country','year'], as_index=False).agg(['mean', 'count'])

             encounter_length
                         mean count
country year
us      2001      1356.911726  2445
        2002     26549.112813  2439
        2003      1229.873901  2958
        2004      2014.706880  3244
        2005      1126.444772  3227
        2006      1156.480149  2884
        2007      2539.177378  3470
        2008      4336.709833  4017
        2009      3229.618521  3677
        2010      2271.987232  3548

# BONUS 2: Which months are the ones with the highest numbers of occurrences?

In [82]:
ufo_vars['month'].value_counts().sort_values(ascending=False)

7     9520
8     8636
6     8152
9     7589
10    7407
11    6739
1     5689
12    5665
4     5527
3     5450
5     5293
2     4665
Name: month, dtype: int64

# BONUS 3: Finally, you gathered information about the UFO dataset. Using your last result, try to bring that information for your original dataset.

1. Store the results of your previous analysis (the mean value for the encounter_seconds for each year and each country) in a dataframe called `avg_results`.

In [21]:
avg_results = ufo_vars.groupby(['country','year']).agg(mean_seconds = ('encounter_length', 'mean'),
                                                                       count_seconds = ('encounter_length', 'count'))
avg_results

              mean_seconds  count_seconds
country year
au      1958   2700.000000              1
        1960    180.000000              1
        1967    300.000000              1
        1968    300.000000              1
        1972    403.333333              3
...                    ...            ...
us      2010   2271.987232           3548
        2011   2544.292555           4379
        2012  10640.644916           6320
        2013   1266.387888           6056
        2014    782.372979           1964

[282 rows x 2 columns]

In [22]:
ufo.head()

,date_documented,date,year,month,day,date_time,city_area,state,country,ufo_shape,encounter_length,described_encounter_length,description,latitude,longitude
0,4/27/2004,1949-10-10,1949,10,10,10/10/1949 20:30,san marcos,tx,us,cylinder,2700.0,45 minutes,This event took place in early fall around 194...,29.883056,-97.941111
1,12/16/2005,1949-10-10,1949,10,10,10/10/1949 21:00,lackland afb,tx,NaN,light,7200.0,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,29.384210,-98.581082
2,1/21/2008,1955-10-10,1955,10,10,10/10/1955 17:00,chester (uk/england),NaN,gb,circle,20.0,20 seconds,Green/Orange circular disc over Chester&#44 En...,53.200000,-2.916667
3,1/17/2004,1956-10-10,1956,10,10,10/10/1956 21:00,edna,tx,us,circle,20.0,1/2 hour,My older brother and twin sister were leaving ...,28.978333,-96.645833
4,1/22/2004,1960-10-10,1960,10,10,10/10/1960 20:00,kaneohe,hi,us,light,900.0,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,21.418056,-157.803611

In [111]:
avg_results

             encounter_length
                         mean count
country year
au      1958      2700.000000     1
        1960       180.000000     1
        1967       300.000000     1
        1968       300.000000     1
        1972       403.333333     3
...                       ...   ...
us      2010      2271.987232  3548
        2011      2544.292555  4379
        2012     10640.644916  6320
        2013      1266.387888  6056
        2014       782.372979  1964

[282 rows x 2 columns]

2. Rename the column named `encounter_seconds` to `avg_encounter_seconds`.

In [23]:
avg_results.rename(columns={'encounter_length': 'avg_encounter_seconds'})

              mean_seconds  count_seconds
country year
au      1958   2700.000000              1
        1960    180.000000              1
        1967    300.000000              1
        1968    300.000000              1
        1972    403.333333              3
...                    ...            ...
us      2010   2271.987232           3548
        2011   2544.292555           4379
        2012  10640.644916           6320
        2013   1266.387888           6056
        2014    782.372979           1964

[282 rows x 2 columns]

3. Use the pd.merge( ... ) function to bring that new collected information to your original dataset.
The pd.merge() function requires several arguments, let's understand the most important ones.

`left` is the dataframe you want to bring information **to** - the table on the left. In this case, this will be our original dataframe called `ufo`

`right` is the dataframe you want to bring information **from** - the table on the right. In this case, this will be our resulting dataframe `avg_results`.

`on` is the key you want to perform the merge. That is, if those values are **exactly equal** in both dataframes, then the information will be brought.

Put your results on a dataframe called `merged_ufo`

In [30]:
ufo.head()

,date_documented,date,year,month,day,date_time,city_area,state,country,ufo_shape,encounter_length,described_encounter_length,description,latitude,longitude
0,4/27/2004,1949-10-10,1949,10,10,10/10/1949 20:30,san marcos,tx,us,cylinder,2700.0,45 minutes,This event took place in early fall around 194...,29.883056,-97.941111
1,12/16/2005,1949-10-10,1949,10,10,10/10/1949 21:00,lackland afb,tx,NaN,light,7200.0,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,29.384210,-98.581082
2,1/21/2008,1955-10-10,1955,10,10,10/10/1955 17:00,chester (uk/england),NaN,gb,circle,20.0,20 seconds,Green/Orange circular disc over Chester&#44 En...,53.200000,-2.916667
3,1/17/2004,1956-10-10,1956,10,10,10/10/1956 21:00,edna,tx,us,circle,20.0,1/2 hour,My older brother and twin sister were leaving ...,28.978333,-96.645833
4,1/22/2004,1960-10-10,1960,10,10,10/10/1960 20:00,kaneohe,hi,us,light,900.0,15 minutes,AS a Marine 1st Lt. flying an FJ4B fighter/att...,21.418056,-157.803611

In [28]:
merged_ufo = pd.merge(left=ufo, right=avg_results, on='year')
merged_ufo.head()

,date_documented,date,year,month,day,date_time,city_area,state,country,ufo_shape,encounter_length,described_encounter_length,description,latitude,longitude,mean_seconds,count_seconds
0,4/27/2004,1949-10-10,1949,10,10,10/10/1949 20:30,san marcos,tx,us,cylinder,2700.0,45 minutes,This event took place in early fall around 194...,29.883056,-97.941111,523.333333,15
1,12/16/2005,1949-10-10,1949,10,10,10/10/1949 21:00,lackland afb,tx,NaN,light,7200.0,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,29.384210,-98.581082,523.333333,15
2,3/4/2008,1949-10-15,1949,10,15,10/15/1949 20:00,baltimore,md,us,cigar,180.0,2-3 minutes,It was around 8:PM and I was walking home&#44i...,39.290278,-76.612500,523.333333,15
3,4/27/2004,1949-04-10,1949,4,10,4/10/1949 15:00,seattle,wa,us,disk,600.0,ten minutes,UFO Hovers over Seattle sky,47.606389,-122.330833,523.333333,15
4,3/19/2002,1949-05-01,1949,5,1,5/1/1949 14:00,oak ridge (drive),wv,us,other,40.0,40seconds,log shape whooshing object observed near charl...,38.075000,-81.109722,523.333333,15

Check how many rows the final result has and try to explain it. Did the dataset get smaller? Bigger? Or the same? Can you explain why? 

*hint: If you've found something weird, try looking back at your original dataframe and find something interesting on it.*

In [29]:
print('Ufo shape: ', ufo.shape)
print('Avg result shape: ', avg_results.shape)
print('Merged ufo shape: ', merged_ufo.shape)

Ufo shape:  (80332, 15)
Avg result shape:  (282, 2)
Merged ufo shape:  (393893, 17)

## Store the results into a new csv file called `ufo_enriched.csv`. 

Don't forget to use `index=False`.

In [94]:
merged_ufo.to_csv('./data/ufo_enriched.csv', index=False)